{
  "max_new_tokens": 512,
  "do_sample": true,
  "top_p": 0.95,
  "top_k": 50,
  "temperature": 0.7,
  "repetition_penalty": 1.0,
  "length_penalty": 1.0,
  "early_stopping": false,
  "num_beams": 1,
  "num_beam_groups": 1,
  "diversity_penalty": 0.0,
  "use_cache": true,
  "pad_token_id": 0,
  "bos_token_id": 1,
  "eos_token_id": 2,
  "encoder_no_repeat_ngram_size": 0,
  "decoder_no_repeat_ngram_size": 0,
  "prefix_allowed_tokens_fn": null,
  "forced_bos_token_id": null,
  "forced_eos_token_id": null,
  "remove_invalid_values": true,
  "exponential_decay_length_penalty": null,
  "renormalize_logits": false,
  "suppress_tokens": null,
  "begin_suppress_tokens": null,
  "forced_decoder_ids": null,
  "bad_words_ids": null,
  "no_repeat_ngram_size": 0,
  "architectures": [
    "LlamaForCausalLM"
  ],
  "attention_bias": true,
  "attention_dropout": 0.0,
  "eos_token_id": 2,
  "hidden_act": "silu",
  "hidden_size": 5120,
  "initializer_range": 0.02,
  "intermediate_size": 13824,
  "max_position_embeddings": 8192,
  "model_type": "llama",
  "num_attention_heads": 40,
  "num_hidden_layers": 64,
  "num_key_value_heads": 40,
  "pretraining_tp": 1,
  "rms_norm_eps": 1e-05,
  "rope_scaling": {
    "factor": 32.0,
    "type": "linear"
  },
  "tie_word_embeddings": false,
  "torch_dtype": "float16",
  "use_cache": true,
  "vocab_size": 50000
}